In [27]:
import pandas as pd

In [28]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [29]:
filename = './../data/memberInfo.csv'
df = pd.read_csv(filename,index_col='id')
df

     kor  eng
id
김철수   60   70
홍길동   70   75
박영희   80   80

In [30]:
df.columns

Index(['kor', 'eng'], dtype='object')

In [31]:
df.index

Index(['김철수', '홍길동', '박영희'], dtype='object', name='id')

In [32]:
df.values

array([[60, 70],
       [70, 75],
       [80, 80]], dtype=int64)

In [33]:
print('시리즈와 apply 메서드')

시리즈와 apply 메서드

In [34]:
print( '일반적인 산술 연산' )
df['kor'] + 5

일반적인 산술 연산

id
김철수    65
홍길동    75
박영희    85
Name: kor, dtype: int64

In [35]:
def plus5(x):
    return x + 5

In [36]:
df.loc[:,'kor']

id
김철수    60
홍길동    70
박영희    80
Name: kor, dtype: int64

In [37]:
print('apply 함수를 적용한 결과')
sq = df['kor'].apply(plus5) 
sq

apply 함수를 적용한 결과

id
김철수    65
홍길동    75
박영희    85
Name: kor, dtype: int64

In [38]:
def gob(x, n):
    return n * x

In [39]:
ex = df['kor'].apply(gob, n=2) 
ex

id
김철수    120
홍길동    140
박영희    160
Name: kor, dtype: int64

In [40]:
ex = df['kor'].apply(gob, n=3) 
ex

id
김철수    180
홍길동    210
박영희    240
Name: kor, dtype: int64

In [41]:
def applyByColumn(col):
    mysum = 0
    for item in col:
        mysum += item
    return mysum / df.shape[0]

In [42]:
df

     kor  eng
id
김철수   60   70
홍길동   70   75
박영희   80   80

In [12]:
df.apply(applyByColumn, axis = 0)

kor    70.0
eng    75.0
dtype: float64

In [13]:
def applyByRow(row):
    mysum = 0
    for item in row:
        mysum += item
    return mysum / df.shape[1]

In [14]:
df.apply(applyByRow, axis = 1)

id
김철수    65.0
홍길동    72.5
박영희    80.0
dtype: float64

In [44]:
df

     kor  eng
id
김철수   60   70
홍길동   70   75
박영희   80   80

In [46]:
df.map(lambda x : x * 2)

     kor  eng
id
김철수  120  140
홍길동  140  150
박영희  160  160